#+STARTUP: indent
#+TITLE: stock
#+AUTHOR: Jimmy m Gong
#+EMAIL: yssource@163.com
#+LANGUAGE: zh-Hans
#+OPTIONS: H:3 num:nil toc:nil \n:t ::t |:t ^:nil -:nil f:t *:t <:t html-postamble:nil
#+URI: /blog/%y/%m/%d/
#+DATE: 2016-11-20
#+LAYOUT: post
#+TAGS:
#+CATEGORIES:
#+DESCRIPTON:

* Contents

#+BEGIN_HTML
<!--more-->
#+END_HTML

#+BEGIN_SRC python :results output
  import os
  import pprint as pp
  import pandas as pd
  pd.set_option('display.max_rows', 200)
  print(os.sys.version)

  import tushare as ts
  ts.set_token('0abb4c5e6a67416494640fb0c569989f2b7866973037b881cf3b65a3a73718ff')
  # ts.get_latest_news() #默认获取最近80条新闻数据，只提供新闻类型、链接和标题
  # r = ts.get_latest_news(top=5,show_content=True) #显示最新5条新闻，并打印出新闻内容
  # r = ts.get_notices()
  # r = ts.cap_tops()
  # r = r.sort('count', ascending=False)
  # r = ts.inst_tops()
  #获取一段时间内的日期是否为交易日，isOpen=1是交易日，isOpen=0为休市
  mt = ts.Master()
  df = mt.TradeCal(exchangeCD='XSHG', beginDate='20160928', endDate='20161010', field='calendarDate,isOpen,prevTradeDate')
  r = df
  pp.pprint(r)
  # pp.pprint(ts.get_token())
  # df = ts.profit_data(top=60)
  # df.sort('shares',ascending=False)
  # pp.pprint(df)
#+END_SRC

#+BEGIN_SRC python :results output
  import tushare as ts
  import pprint as pp

  code = '002189'
  df = ts.get_sina_dd(code, date='2016-11-24', vol=400) #默认400手
  #df = ts.get_sina_dd('600848', date='2015-12-24', vol=500)  #指定大于等于500手的数据
  pp.pprint(df)
#+END_SRC

#+RESULTS:
:      code   name      time  price  volume  preprice type
: 0  000505  *ST珠江  09:49:09  12.40  100000     12.36   买盘
: 1  000505  *ST珠江  09:30:06  12.35   59600     12.28   买盘
: 2  000505  *ST珠江  09:25:03  12.22   50800      0.00  中性盘

#+NAME: expenses
|  n |       date | sec_code    | change_pct | net_amount_main | net_pct_main | net_amount_xl | net_pct_xl | net_amount_l | net_pct_l | net_amount_m | net_pct_m | net_amount_s | net_pct_s |
|  0 | 2016-11-14 | 002189.XSHE |       2.53 |         2532.42 |        12.83 |        686.97 |       3.48 |      1845.45 |      9.35 |      -485.27 |     -2.46 |     -2047.15 |    -10.37 |
|  1 | 2016-11-15 | 002189.XSHE |      -0.49 |         -379.14 |        -3.18 |        267.15 |       2.24 |      -646.29 |     -5.42 |       -11.39 |     -0.10 |       390.53 |      3.27 |
|  2 | 2016-11-16 | 002189.XSHE |       0.00 |         -287.40 |        -2.33 |         96.62 |       0.78 |      -384.02 |     -3.11 |       433.88 |      3.52 |      -146.48 |     -1.19 |
|  3 | 2016-11-17 | 002189.XSHE |      -0.93 |         -293.82 |        -4.04 |       -109.68 |      -1.51 |      -184.15 |     -2.53 |      -323.25 |     -4.45 |       617.07 |      8.49 |
|  4 | 2016-11-18 | 002189.XSHE |      -0.37 |         -118.75 |        -2.01 |        211.60 |       3.58 |      -330.34 |     -5.59 |       -60.14 |     -1.02 |       178.89 |      3.03 |
|  5 | 2016-11-21 | 002189.XSHE |      -0.12 |         -301.41 |        -5.36 |         85.49 |       1.52 |      -386.90 |     -6.88 |       -57.94 |     -1.03 |       359.35 |      6.39 |
|  6 | 2016-11-22 | 002189.XSHE |       1.53 |          813.67 |         8.25 |        347.97 |       3.53 |       465.70 |      4.72 |      -355.77 |     -3.61 |      -457.90 |     -4.64 |
|  7 | 2016-11-23 | 002189.XSHE |      -0.85 |          -36.79 |        -0.27 |        528.63 |       3.94 |      -565.42 |     -4.21 |      -601.79 |     -4.48 |       638.58 |      4.76 |
|  8 | 2016-11-24 | 002189.XSHE |      -0.98 |         -454.27 |        -5.73 |        500.06 |       6.30 |      -954.32 |    -12.03 |      -505.42 |     -6.37 |       959.69 |     12.10 |
|  9 | 2016-11-25 | 002189.XSHE |       1.65 |         1670.49 |        14.70 |        545.18 |       4.80 |      1125.31 |      9.90 |      -513.07 |     -4.52 |     -1157.42 |    -10.19 |
| 10 | 2016-11-28 | 002189.XSHE |       0.04 |          619.25 |         6.08 |       -337.49 |      -3.31 |       956.75 |      9.39 |       -83.30 |     -0.82 |      -535.95 |     -5.26 |
| 11 | 2016-11-29 | 002189.XSHE |      -1.75 |        -1558.82 |       -18.66 |       -191.17 |      -2.29 |     -1367.65 |    -16.37 |       657.83 |      7.87 |       900.99 |     10.78 |
| 12 | 2016-11-30 | 002189.XSHE |       0.12 |         -267.39 |        -5.45 |         97.62 |       1.99 |      -365.01 |     -7.44 |       151.08 |      3.08 |       116.31 |      2.37 |
| 13 | 2016-12-01 | 002189.XSHE |       1.03 |          735.78 |         9.43 |        549.81 |       7.05 |       185.96 |      2.38 |      -434.86 |     -5.57 |      -300.92 |     -3.86 |
| 14 | 2016-12-02 | 002189.XSHE |       1.72 |        -3663.67 |        -9.29 |      -1456.56 |      -3.69 |     -2207.12 |     -5.60 |      -584.15 |     -1.48 |      4247.82 |     10.78 |
|    |            |             |            |        -989.850 |              |               |            |              |           |              |           |              |           |
#+TBLFM: @>$5=vsum(@2..@-1);%.3f



#+TBLFM: @2$4=sum($2..$3)

| Student  | Maths | Physics | Mean |
|----------+-------+---------+------|
| Bertrand |    13 |      09 |   11 |
| Henri    |    15 |      14 |      |
| Arnold   |    17 |      13 |      |
#+TBLFM: @2$4=vmean($2..$3)

| Date       | Category         |            Amount |
|------------+------------------+-------------------|
| 2014/01/14 | Supplies         |             43.97 |
| 2014/02/15 | Supplies         |             56.48 |
| 2014/02/11 | Book             |             17.99 |
| 2014/06/10 | Kinesis Keyboard |            289.16 |
| 2014/08/22 | Books            |             18.99 |
| 2014/08/23 | Printer          |             99.96 |
| 2014/08/25 | Books            |              7.50 |
| 2014/08/30 | Supplies         |             58.26 |
| 2014/09/15 | Books            |             21.49 |
|------------+------------------+-------------------|
|            | Total:           | 613.8000000000001 |
|            |                  |                   |




  Office Supplies                                                 :noexport:
#+NAME: expenses
| Category              |  Amount |
|-----------------------+---------|
| Domain Registration   |   87.15 |
| Fax Service           |  119.40 |
| Hosting Services      |  251.84 |
| Office Expenses       |  433.81 |
| Internet Connectivity | 1510.14 |
|-----------------------+---------|
| Total:                |         |
#+TBLFM: @>$2=vsum(@2..@-1);%.2f::@2$2=remote(domain,@>$4);%.2f:: ...


  |        |  1 | 2 | 3    |
  |--------+----+---+------|
  | a.b    |  4 | 6 | etc. |
  | a      |  1 | 2 | etc. |
  | b      |  3 | 4 | etc. |
  |--------+----+---+------|
  | Total: | 10 |   |      |
  #+TBLFM: @>$2=vsum(@2$2..@2$3)::@2$2=@3$2+@4$2::@2$3=@3$3+@4$3

  |        |  1 | 2 |  3 |
  |--------+----+---+----|
  | a.b    |  4 | 6 | 11 |
  | a      |  1 | 2 |  5 |
  | b      |  3 | 4 |  6 |
  |--------+----+---+----|
  | Total: | 21 |   |    |
  #+TBLFM: @>$2=vsum(@2$2..@2$4)::@2$2..@2$4=vsum(trn(pack([2, 3], @3$2..@4$4))_($#-1))





|  n |       date | sec_code    | change_pct | net_amount_main | net_pct_main | net_amount_xl | net_pct_xl | net_amount_l | net_pct_l | net_amount_m | net_pct_m | net_amount_s | net_pct_s |
|----+------------+-------------+------------+-----------------+--------------+---------------+------------+--------------+-----------+--------------+-----------+--------------+-----------|
|  0 | 2016-08-02 | 002189.XSHE |       1.75 |         -989.04 |        -7.69 |        -60.92 |      -0.47 |      -928.11 |     -7.22 |       233.39 |      1.82 |       755.65 |      5.88 |
|  1 | 2016-08-03 | 002189.XSHE |      -0.88 |         -993.62 |        -9.55 |       -160.00 |      -1.54 |      -833.62 |     -8.01 |      -516.58 |     -4.97 |      1510.20 |     14.52 |
|  2 | 2016-08-04 | 002189.XSHE |       2.91 |         1323.63 |         8.05 |         63.93 |       0.39 |      1259.70 |      7.66 |      -151.24 |     -0.92 |     -1172.39 |     -7.13 |
|  3 | 2016-08-05 | 002189.XSHE |      -1.02 |         -643.09 |        -4.90 |       -256.18 |      -0.00 |      -386.90 |     -0.00 |        23.00 |      0.00 |       620.08 |      0.00 |
|  4 | 2016-08-08 | 002189.XSHE |       0.59 |          -22.68 |        -0.16 |        -47.95 |      -0.34 |        25.27 |      0.18 |      -260.01 |     -1.84 |       282.69 |      2.00 |
|  5 | 2016-08-09 | 002189.XSHE |       1.89 |         1107.11 |         6.85 |       -106.72 |      -0.66 |      1213.84 |      7.51 |      -306.92 |     -1.90 |      -800.19 |     -4.95 |
|  6 | 2016-08-10 | 002189.XSHE |      -1.24 |         -808.72 |        -4.76 |       -446.61 |      -2.63 |      -362.11 |     -2.13 |      -876.77 |     -5.16 |      1685.50 |      9.92 |
|  7 | 2016-08-11 | 002189.XSHE |      -2.58 |         -875.73 |        -7.46 |         73.57 |       0.63 |      -949.30 |     -8.09 |      -806.12 |     -6.87 |      1681.85 |     14.33 |
|  8 | 2016-08-12 | 002189.XSHE |       1.25 |         -278.57 |        -3.27 |         27.54 |       0.32 |      -306.11 |     -3.59 |        78.82 |      0.93 |       199.75 |      2.35 |
|  9 | 2016-08-15 | 002189.XSHE |       2.34 |         1293.19 |         7.85 |        386.56 |       2.35 |       906.64 |      5.50 |        48.35 |      0.29 |     -1341.55 |     -8.14 |
| 10 | 2016-08-16 | 002189.XSHE |       0.31 |          -11.01 |        -0.07 |        -68.76 |      -0.46 |        57.75 |      0.39 |       -33.31 |     -0.22 |        44.32 |      0.30 |
| 11 | 2016-08-17 | 002189.XSHE |       0.15 |         -881.88 |        -6.16 |         54.10 |       0.38 |      -935.98 |     -6.53 |       -92.26 |     -0.64 |       974.15 |      6.80 |
| 12 | 2016-08-18 | 002189.XSHE |       0.23 |         -470.58 |        -2.77 |       -265.98 |      -1.56 |      -204.60 |     -1.20 |       -19.12 |     -0.11 |       489.70 |      2.88 |
| 13 | 2016-08-19 | 002189.XSHE |      -1.35 |        -1993.32 |       -16.19 |       -104.85 |      -0.85 |     -1888.47 |    -15.34 |       175.97 |      1.43 |      1817.35 |     14.76 |
| 14 | 2016-08-22 | 002189.XSHE |      -2.26 |        -1647.01 |       -15.67 |        -10.58 |      -0.10 |     -1636.43 |    -15.57 |      -354.45 |     -3.37 |      2001.47 |     19.05 |
| 15 | 2016-08-23 | 002189.XSHE |       0.00 |         -905.22 |       -11.37 |       -327.84 |      -4.12 |      -577.38 |     -7.25 |      -161.24 |     -2.03 |      1066.45 |     13.40 |
| 16 | 2016-08-24 | 002189.XSHE |       5.63 |         5154.89 |        11.80 |       4146.32 |       9.49 |      1008.58 |      2.31 |     -2348.52 |     -5.37 |     -2806.38 |     -6.42 |
| 17 | 2016-08-25 | 002189.XSHE |      -2.46 |        -2208.63 |       -10.44 |      -1422.13 |      -6.72 |      -786.50 |     -3.72 |       373.46 |      1.77 |      1835.17 |      8.67 |
| 18 | 2016-08-26 | 002189.XSHE |      -0.23 |        -1739.65 |       -12.97 |       -319.05 |      -2.38 |     -1420.60 |    -10.59 |       677.61 |      5.05 |      1062.05 |      7.92 |
| 19 | 2016-08-29 | 002189.XSHE |      -0.16 |         -850.52 |        -9.02 |       -434.94 |      -4.61 |      -415.58 |     -4.41 |      -126.37 |     -1.34 |       976.89 |     10.36 |
| 20 | 2016-08-30 | 002189.XSHE |       2.06 |         2848.08 |        10.01 |       2129.68 |       7.49 |       718.41 |      2.53 |     -1356.40 |     -4.77 |     -1491.68 |     -5.24 |
| 21 | 2016-08-31 | 002189.XSHE |      -1.41 |        -2619.77 |       -16.93 |       -112.03 |      -0.72 |     -2507.74 |    -16.20 |       -51.29 |     -0.33 |      2671.06 |     17.26 |
| 22 | 2016-09-01 | 002189.XSHE |      -1.86 |        -1442.80 |       -10.78 |       -796.44 |      -5.95 |      -646.36 |     -4.83 |      -726.49 |     -5.43 |      2169.29 |     16.21 |
| 23 | 2016-09-02 | 002189.XSHE |       0.12 |         -624.87 |        -6.05 |       -107.01 |      -1.04 |      -517.86 |     -5.02 |      -313.63 |     -3.04 |       938.50 |      9.09 |
| 24 | 2016-09-05 | 002189.XSHE |      -0.59 |        -1131.86 |       -11.32 |       -400.26 |      -4.00 |      -731.61 |     -7.32 |       105.79 |      1.06 |      1026.07 |     10.26 |
| 25 | 2016-09-06 | 002189.XSHE |       1.78 |          873.65 |         6.11 |        431.16 |       3.01 |       442.49 |      3.09 |      -762.06 |     -5.33 |      -111.60 |     -0.78 |
| 26 | 2016-09-07 | 002189.XSHE |      -0.97 |        -1203.97 |       -11.49 |       -332.06 |      -3.17 |      -871.91 |     -8.32 |       -20.99 |     -0.20 |      1224.95 |     11.69 |
| 27 | 2016-09-08 | 002189.XSHE |       0.75 |          429.36 |         5.02 |         48.76 |       0.57 |       380.60 |      4.45 |      -190.39 |     -2.23 |      -238.97 |     -2.80 |
| 28 | 2016-09-09 | 002189.XSHE |       0.31 |          622.78 |         3.66 |        179.17 |       1.05 |       443.61 |      2.60 |      -193.73 |     -1.14 |      -429.05 |     -2.52 |
| 29 | 2016-09-12 | 002189.XSHE |      -6.49 |        -3148.84 |       -18.70 |       -789.43 |      -4.69 |     -2359.41 |    -14.01 |      -779.22 |     -4.63 |      3928.06 |     23.32 |
| 30 | 2016-09-13 | 002189.XSHE |       0.58 |         -425.26 |        -4.98 |       -274.12 |      -3.21 |      -151.13 |     -1.77 |      -709.13 |     -8.30 |      1134.39 |     13.27 |
| 31 | 2016-09-14 | 002189.XSHE |       0.00 |          168.07 |         2.15 |        -41.19 |      -0.53 |       209.26 |      2.68 |      -624.05 |     -7.98 |       455.98 |      5.83 |
| 32 | 2016-09-19 | 002189.XSHE |       0.54 |         -629.40 |       -10.59 |         74.07 |       1.25 |      -703.47 |    -11.84 |        95.55 |      1.61 |       533.85 |      8.99 |
| 33 | 2016-09-20 | 002189.XSHE |      -0.99 |         -816.54 |       -14.50 |          0.00 |       0.00 |      -816.54 |    -14.50 |       -89.27 |     -1.59 |       905.81 |     16.09 |
| 34 | 2016-09-21 | 002189.XSHE |       0.62 |          667.44 |        11.01 |        123.12 |       2.03 |       544.31 |      8.98 |      -409.39 |     -6.75 |      -258.05 |     -4.26 |
| 35 | 2016-09-22 | 002189.XSHE |       0.00 |         -203.05 |        -3.17 |        -98.00 |      -1.53 |      -105.05 |     -1.64 |        44.02 |      0.69 |       159.03 |      2.48 |
| 36 | 2016-09-23 | 002189.XSHE |      -0.91 |        -1143.05 |       -18.44 |       -143.79 |      -2.32 |      -999.25 |    -16.12 |       116.34 |      1.88 |      1026.70 |     16.56 |
| 37 | 2016-09-26 | 002189.XSHE |      -4.17 |        -1151.86 |       -11.78 |       -189.88 |      -1.94 |      -961.99 |     -9.84 |      -832.77 |     -8.52 |      1984.64 |     20.29 |
| 38 | 2016-09-27 | 002189.XSHE |       1.39 |           -1.55 |        -0.02 |        -72.46 |      -0.98 |        70.92 |      0.96 |        31.27 |      0.42 |       -29.72 |     -0.40 |
| 39 | 2016-09-28 | 002189.XSHE |      -0.90 |         -641.15 |       -14.42 |       -120.37 |      -2.71 |      -520.78 |    -11.71 |      -157.08 |     -3.53 |       798.24 |     17.95 |
| 40 | 2016-09-29 | 002189.XSHE |      -0.13 |           23.92 |         0.61 |          0.00 |       0.00 |        23.92 |      0.61 |      -167.35 |     -4.24 |       143.43 |      3.63 |
| 41 | 2016-09-30 | 002189.XSHE |       4.03 |         1136.70 |         8.39 |        917.47 |       6.77 |       219.23 |      1.62 |      -657.29 |     -4.85 |      -479.41 |     -3.54 |
| 42 | 2016-10-10 | 002189.XSHE |       1.00 |        -1485.27 |       -12.11 |       -186.82 |      -1.52 |     -1298.45 |    -10.58 |       530.89 |      4.33 |       954.38 |      7.78 |
| 43 | 2016-10-11 | 002189.XSHE |      -0.25 |         -432.75 |        -5.66 |       -119.31 |      -1.56 |      -313.44 |     -4.10 |       -35.12 |     -0.46 |       467.87 |      6.12 |
| 44 | 2016-10-12 | 002189.XSHE |       0.04 |           86.48 |         1.32 |        -71.25 |      -1.09 |       157.73 |      2.41 |       -92.25 |     -1.41 |         5.77 |      0.09 |
| 45 | 2016-10-13 | 002189.XSHE |      -0.12 |            6.35 |         0.09 |        -43.92 |      -0.61 |        50.27 |      0.69 |      -441.33 |     -6.09 |       434.98 |      6.01 |
| 46 | 2016-10-14 | 002189.XSHE |      -0.99 |         -502.40 |        -9.17 |        -97.38 |      -1.78 |      -405.02 |     -7.39 |      -306.83 |     -5.60 |       809.24 |     14.76 |
| 47 | 2016-10-17 | 002189.XSHE |      -1.59 |         -448.38 |        -7.26 |          8.99 |       0.15 |      -457.37 |     -7.40 |      -519.91 |     -8.41 |       968.29 |     15.67 |
| 48 | 2016-10-18 | 002189.XSHE |       1.74 |          256.39 |         3.81 |        113.54 |       1.69 |       142.85 |      2.12 |      -345.58 |     -5.13 |        89.18 |      1.32 |
| 49 | 2016-10-19 | 002189.XSHE |       0.38 |           83.72 |         1.18 |          0.00 |       0.00 |        83.72 |      1.18 |      -147.20 |     -2.07 |        63.48 |      0.89 |
| 50 | 2016-10-20 | 002189.XSHE |       1.79 |         2150.73 |        14.17 |        714.52 |       4.71 |      1436.21 |      9.46 |       -35.81 |     -0.24 |     -2114.92 |    -13.93 |
| 51 | 2016-10-21 | 002189.XSHE |      -1.27 |         -862.95 |        -9.27 |          0.00 |       0.00 |      -862.95 |     -9.27 |       -60.98 |     -0.65 |       923.93 |      9.92 |
| 52 | 2016-10-24 | 002189.XSHE |       0.37 |          474.10 |         6.56 |         99.36 |       1.38 |       374.74 |      5.19 |       -50.07 |     -0.69 |      -424.03 |     -5.87 |
| 53 | 2016-10-25 | 002189.XSHE |       0.37 |          386.09 |         5.26 |       -547.99 |      -7.46 |       934.08 |     12.72 |       -23.72 |     -0.32 |      -362.37 |     -4.94 |
| 54 | 2016-10-26 | 002189.XSHE |      -1.15 |         -601.83 |        -7.42 |       -123.07 |      -1.52 |      -478.76 |     -5.91 |      -434.09 |     -5.35 |      1035.92 |     12.78 |
| 55 | 2016-10-27 | 002189.XSHE |      -0.04 |         -353.43 |        -5.60 |       -160.67 |      -2.55 |      -192.76 |     -3.06 |        16.67 |      0.26 |       336.75 |      5.34 |
| 56 | 2016-10-28 | 002189.XSHE |      -0.96 |         -234.47 |        -2.92 |       -202.98 |      -2.53 |       -31.49 |     -0.39 |       194.49 |      2.43 |        39.98 |      0.50 |
| 57 | 2016-10-31 | 002189.XSHE |      -0.34 |           42.88 |         0.76 |        238.18 |       4.22 |      -195.30 |     -3.46 |      -324.34 |     -5.75 |       281.45 |      4.99 |
| 58 | 2016-11-01 | 002189.XSHE |       1.22 |          647.24 |         9.71 |        163.51 |       2.45 |       483.73 |      7.26 |      -120.13 |     -1.80 |      -527.11 |     -7.91 |
| 59 | 2016-11-02 | 002189.XSHE |      -0.79 |          245.22 |         3.29 |        244.30 |       3.28 |         0.92 |      0.01 |      -446.74 |     -6.00 |       201.52 |      2.70 |
| 60 | 2016-11-03 | 002189.XSHE |       0.38 |          370.70 |         3.79 |        378.02 |       3.87 |        -7.31 |     -0.07 |      -283.94 |     -2.91 |       -86.76 |     -0.89 |
| 61 | 2016-11-04 | 002189.XSHE |       1.00 |          502.79 |         5.37 |         69.08 |       0.74 |       433.71 |      4.63 |      -150.25 |     -1.60 |      -352.54 |     -3.76 |
| 62 | 2016-11-07 | 002189.XSHE |      -0.58 |         -574.15 |        -6.61 |       -124.96 |      -1.44 |      -449.19 |     -5.17 |       -93.64 |     -1.08 |       667.79 |      7.69 |
| 63 | 2016-11-08 | 002189.XSHE |       0.12 |         -236.41 |        -3.51 |        -78.35 |      -1.16 |      -158.06 |     -2.35 |      -226.81 |     -3.37 |       463.22 |      6.88 |
| 64 | 2016-11-09 | 002189.XSHE |      -1.95 |        -1254.53 |       -11.48 |       -269.84 |      -2.47 |      -984.69 |     -9.01 |      -494.35 |     -4.52 |      1748.88 |     16.00 |
| 65 | 2016-11-10 | 002189.XSHE |       1.31 |          638.28 |         9.16 |        134.68 |       1.93 |       503.60 |      7.23 |      -176.65 |     -2.53 |      -461.63 |     -6.62 |
| 66 | 2016-11-11 | 002189.XSHE |       0.88 |         -588.18 |        -5.01 |       -310.08 |      -2.64 |      -278.10 |     -2.37 |       669.87 |      5.71 |       -81.69 |     -0.70 |
| 67 | 2016-11-14 | 002189.XSHE |       2.53 |         2532.42 |        12.83 |        686.97 |       3.48 |      1845.45 |      9.35 |      -485.27 |     -2.46 |     -2047.15 |    -10.37 |
| 68 | 2016-11-15 | 002189.XSHE |      -0.49 |         -379.14 |        -3.18 |        267.15 |       2.24 |      -646.29 |     -5.42 |       -11.39 |     -0.10 |       390.53 |      3.27 |
| 69 | 2016-11-16 | 002189.XSHE |       0.00 |         -287.40 |        -2.33 |         96.62 |       0.78 |      -384.02 |     -3.11 |       433.88 |      3.52 |      -146.48 |     -1.19 |
| 70 | 2016-11-17 | 002189.XSHE |      -0.93 |         -293.82 |        -4.04 |       -109.68 |      -1.51 |      -184.15 |     -2.53 |      -323.25 |     -4.45 |       617.07 |      8.49 |
| 71 | 2016-11-18 | 002189.XSHE |      -0.37 |         -118.75 |        -2.01 |        211.60 |       3.58 |      -330.34 |     -5.59 |       -60.14 |     -1.02 |       178.89 |      3.03 |
| 72 | 2016-11-21 | 002189.XSHE |      -0.12 |         -301.41 |        -5.36 |         85.49 |       1.52 |      -386.90 |     -6.88 |       -57.94 |     -1.03 |       359.35 |      6.39 |
| 73 | 2016-11-22 | 002189.XSHE |       1.53 |          813.67 |         8.25 |        347.97 |       3.53 |       465.70 |      4.72 |      -355.77 |     -3.61 |      -457.90 |     -4.64 |
| 74 | 2016-11-23 | 002189.XSHE |      -0.85 |          -36.79 |        -0.27 |        528.63 |       3.94 |      -565.42 |     -4.21 |      -601.79 |     -4.48 |       638.58 |      4.76 |
| 75 | 2016-11-24 | 002189.XSHE |      -0.98 |         -454.27 |        -5.73 |        500.06 |       6.30 |      -954.32 |    -12.03 |      -505.42 |     -6.37 |       959.69 |     12.10 |
| 76 | 2016-11-25 | 002189.XSHE |       1.65 |         1670.49 |        14.70 |        545.18 |       4.80 |      1125.31 |      9.90 |      -513.07 |     -4.52 |     -1157.42 |    -10.19 |
| 77 | 2016-11-28 | 002189.XSHE |       0.04 |          619.25 |         6.08 |       -337.49 |      -3.31 |       956.75 |      9.39 |       -83.30 |     -0.82 |      -535.95 |     -5.26 |
| 78 | 2016-11-29 | 002189.XSHE |      -1.75 |        -1558.82 |       -18.66 |       -191.17 |      -2.29 |     -1367.65 |    -16.37 |       657.83 |      7.87 |       900.99 |     10.78 |
| 79 | 2016-11-30 | 002189.XSHE |       0.12 |         -267.39 |        -5.45 |         97.62 |       1.99 |      -365.01 |     -7.44 |       151.08 |      3.08 |       116.31 |      2.37 |
| 80 | 2016-12-01 | 002189.XSHE |       1.03 |          735.78 |         9.43 |        549.81 |       7.05 |       185.96 |      2.38 |      -434.86 |     -5.57 |      -300.92 |     -3.86 |
| 81 | 2016-12-02 | 002189.XSHE |       1.72 |        -3663.67 |        -9.29 |      -1456.56 |      -3.69 |     -2207.12 |     -5.60 |      -584.15 |     -1.48 |      4247.82 |     10.78 |
|    |            |             |      2.330 |      -17528.050 |     -220.690 |      2795.660 |      1.000 |   -20323.640 |  -216.770 |   -18261.250 |  -165.340 |    35789.270 |   381.160 |
#+TBLFM: @>$5=vsum(@2..@-1);%.3f::@84$4=vsum(@2..@-1);%.3f::@84$6=vsum(@2..@-1);%.3f::@84$7=vsum(@2..@-1);%.3f::@84$8=vsum(@2..@-1);%.3f::@84$9=vsum(@2..@-1);%.3f::@84$10=vsum(@2..@-1);%.3f::@84$11=vsum(@2..@-1);%.3f::@84$12=vsum(@2..@-1);%.3f::@84$13=vsum(@2..@-1);%.3f::@84$14=vsum(@2..@-1);%.3f


#+CONSTANTS: pi=3.14159265358979323846
| Student  | Maths | Physics | Mean | Pi number |
|----------+-------+---------+------+-----------|
| Bertrand |    13 |      09 |   11 |         5 |
| Henri    |    15 |      14 | 14.5 |         7 |
| Arnold   |    17 |      13 |   15 |         9 |
#+TBLFM: $4=vmean($2..$3)::$5='(substring (number-to-string $pi) (round $4) (1+ (round $4)));N

#+BEGIN_SRC calc :var x=5 :var y=2
2+a*x**y
#+END_SRC

#+NAME: sampformula
#+BEGIN_SRC python :var angle=90 :var r=2 :exports none
from math import radians, cos
result = r*cos(radians(angle))
return result
#+END_SRC

| angle |  r |     x |
|-------+----+-------|
|    30 | 10 | 8.660 |
|    45 | 10 | 7.071 |
|    60 | 10 | 5.000 |
#+TBLFM: $3='(org-sbe "sampformula" (angle $1) (r $2));%.3f


#+BEGIN_SRC python :results output :export none
  a = []
  if a:
      print('xxxxxx')
  else:
     print('yyyyyyy')
#+END_SRC
